app/views/books/index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                  <%= link_to book_favorites_path(id: book.id, book_id: book.id), method: :delete, remote: true do %>
                    ❤️<%= book.favorites.count %>いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                  <%= link_to book_favorites_path(id: book.id, book_id: book.id), method: :post, remote: true do %>
                    💙<%= book.favorites.count %>いいね

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
              <td>
                <p>コメント件数：<%= book.book_comment.count %></p>