app/views/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 11]]
---
                  <%= link_to book_favorites_path(@book), method: :delete, remote: true do %>
                    ❤️<%= @book.favorites.count %>いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 11]]
---
                  <%= link_to book_favorites_path(@book), method: :post, remote: true do %>
                    💙<%= @book.favorites.count %>いいね

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 11]]
---
              <td>
                <p>コメント件数：<%= @book.book_comment.count %></p>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 11]]
---
          <tbody>
            <% @book.book_comment.each do |book_comment| %>