app/controllers/book_comments_controller.rb

  def create
    @book = Book.find(params[:book_id])
    @book_comment = current_user.book_comments.new(book_comment_params)
    @book_comment.book_id = @book.id
    if @book_comment.save
      render :index
      # redirect_to book_path(@book)
    else
      @post = Book.new
      @book_comments = BookComment.all
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "test"], ["user_id", 1], ["book_id", 11], ["created_at", "2021-04-03 08:35:18.388493"], ["updated_at", "2021-04-03 08:35:18.388493"]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 5], ["book_id", 1], ["LIMIT", 1]]

  def destroy
    @book = Book.find(params[:book_id])
    BookComment.find_by(id: params[:id], book_id: params[:book_id]).destroy
---
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 13]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 13], ["book_id", 1], ["LIMIT", 1]]