app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["body", "test"], ["created_at", "2021-03-23 08:12:34.433239"], ["updated_at", "2021-03-23 08:12:34.433239"], ["user_id", "1"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      flash[:notice] = "You have created book successfully"
      redirect_to book_path(@book.id)
    else
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 11]]
---
  def show
    @book = Book.find(params[:id])
    @books = Book.all
    @post = Book.new
    @book_comment = BookComment.new
    @book_comments = BookComment.all