app/controllers/favorites_controller.rb

  def create
    favorite = current_user.favorites.new(book_id: @book.id)
    favorite.save
---
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["book_id", 11], ["created_at", "2021-04-03 13:54:17.585921"], ["updated_at", "2021-04-03 13:54:17.585921"]]

  def destroy
    favorite = current_user.favorites.find_by(book_id: @book.id)
    favorite.destroy
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 2], ["book_id", 11], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]

  def set_variables
    @book = Book.find(params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]